### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_ecs_task_definition.default[0] has changed
  ~ resource "aws_ecs_task_definition" "default" {
        id                       = "gost-staging-api"
+       tags                     = {}
        # (13 unchanged attributes hidden)

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id          = "fs-08f95063c1cdbe191"
+               root_directory          = "/"
+               transit_encryption      = "ENABLED"
+               transit_encryption_port = 0

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }
-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id     = "fs-08f95063c1cdbe191" -> null
-               root_directory     = "/" -> null
-               transit_encryption = "ENABLED" -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role.execution[0] has changed
  ~ resource "aws_iam_role" "execution" {
        id                    = "gost-staging-api-ECSTaskExecution-20230217010414321500000009"
        name                  = "gost-staging-api-ECSTaskExecution-20230217010414321500000009"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-09-22T20:16:57Z" -> "2023-09-29T01:36:04Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.aws_iam_role.task[0] has changed
  ~ resource "aws_iam_role" "task" {
        id                    = "gost-staging-api-ECSTask-2023021701041477300000000a"
        name                  = "gost-staging-api-ECSTask-2023021701041477300000000a"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-09-22T19:58:57Z" -> "2023-09-29T01:36:29Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # datadog_monitor.arpa_audit_report-task_failed[0] will be created
+   resource "datadog_monitor" "arpa_audit_report-task_failed" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            {{#is_alert}}
            Alert: One or more ARPA audit report requests were received from the SQS source queue but several attempts to handle them have failed.
            As a result, failing SQS messages have been redirected to the SQS dead-letter queue (DLQ).
            Investigate the issue (especially by checking arpa_audit_report ECS task logs).
            Once the issue is resolved, redrive the DLQ messages back to the source queue and/or delete DLQ messages if they are no longer needed.
            This monitor will not return to normal while there are messages in the DLQ.
            IMPORTANT: DLQ messages are not retained indefinitely; investigation and remediation is time-sensitive.
            {{/is_alert}}
            {{#is_recovery}}
            Recovery: There are no longer messages in the DLQ.
            {{/is_recovery}}
            Notify:
        EOT
+       name                = "GOST (Draft - staging): Grant modification events failed to process"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = (known after apply)
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:gost",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
        name                               = "gost-staging-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:30" -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ network_configuration {
          ~ security_groups  = [
-               "sg-083ce3fb8d4e66859",
-               "sg-0b8d8e7a05714bd3f",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:30" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
-               {
-                   cpu                    = 0
-                   dependsOn              = [
-                       {
-                           condition     = "START"
-                           containerName = "datadog"
                        },
                    ]
-                   dockerLabels           = {
-                       "com.datadoghq.tags.env"     = "staging"
-                       "com.datadoghq.tags.service" = "gost"
-                       "com.datadoghq.tags.version" = "4974fb67de8fb5097b7840a13b32997e1455731f"
                    }
-                   environment            = [
-                       {
-                           name  = "API_DOMAIN"
-                           value = "https://api.staging.grants.usdr.dev"
                        },
-                       {
-                           name  = "AUDIT_REPORT_BUCKET"
-                           value = "gost-staging-arpaauditreports-357150818708-us-west-2-api"
                        },
-                       {
-                           name  = "DATA_DIR"
-                           value = "/var/data"
                        },
-                       {
-                           name  = "DD_ENV"
-                           value = "staging"
                        },
-                       {
-                           name  = "DD_PROFILING_ENABLED"
-                           value = "true"
                        },
-                       {
-                           name  = "DD_SERVICE"
-                           value = "gost"
                        },
-                       {
-                           name  = "DD_VERSION"
-                           value = "4974fb67de8fb5097b7840a13b32997e1455731f"
                        },
-                       {
-                           name  = "ENABLE_GRANTS_DIGEST"
-                           value = "false"
                        },
-                       {
-                           name  = "ENABLE_GRANTS_SCRAPER"
-                           value = "false"
                        },
-                       {
-                           name  = "ENABLE_SAVED_SEARCH_GRANTS_DIGEST"
-                           value = "true"
                        },
-                       {
-                           name  = "GRANTS_SCRAPER_DATE_RANGE"
-                           value = "7"
                        },
-                       {
-                           name  = "GRANTS_SCRAPER_DELAY"
-                           value = "1000"
                        },
-                       {
-                           name  = "NODE_OPTIONS"
-                           value = "--max_old_space_size=1024"
                        },
-                       {
-                           name  = "NOTIFICATIONS_EMAIL"
-                           value = "grants-notifications@staging.grants.usdr.dev"
                        },
-                       {
-                           name  = "PGSSLROOTCERT"
-                           value = "rds-combined-ca-bundle.pem"
                        },
-                       {
-                           name  = "VUE_APP_GRANTS_API_URL"
-                           value = "https://74pah5zi58.execute-api.us-west-2.amazonaws.com"
                        },
-                       {
-                           name  = "WEBSITE_DOMAIN"
-                           value = "https://staging.grants.usdr.dev"
                        },
                    ]
-                   essential              = true
-                   image                  = "ghcr.io/usdigitalresponse/usdr-gost-api:latest"
-                   linuxParameters        = {
-                       capabilities       = {
-                           add  = []
-                           drop = []
                        }
-                       devices            = []
-                       initProcessEnabled = true
-                       tmpfs              = []
                    }
-                   logConfiguration       = {
-                       logDriver = "awslogs"
-                       options   = {
-                           awslogs-group         = "gost-staging-api-20230217010414234200000007"
-                           awslogs-region        = "us-west-2"
-                           awslogs-stream-prefix = "ecs"
                        }
                    }
-                   mountPoints            = [
-                       {
-                           containerPath = "/var/data"
-                           readOnly      = false
-                           sourceVolume  = "data"
                        },
                    ]
-                   name                   = "api"
-                   portMappings           = [
-                       {
-                           containerPort = 3000
-                           hostPort      = 3000
-                           protocol      = "tcp"
                        },
                    ]
-                   readonlyRootFilesystem = false
-                   secrets                = [
-                       {
-                           name      = "COOKIE_SECRET"
-                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/api/cookie_secret"
                        },
-                       {
-                           name      = "POSTGRES_URL"
-                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/postgres/connection_string"
                        },
                    ]
-                   volumesFrom            = []
                },
-               {
-                   cpu                    = 0
-                   dockerLabels           = {
-                       "com.datadoghq.tags.env"     = "staging"
-                       "com.datadoghq.tags.service" = "gost"
-                       "com.datadoghq.tags.version" = "4974fb67de8fb5097b7840a13b32997e1455731f"
                    }
-                   environment            = [
-                       {
-                           name  = "DD_APM_ENABLED"
-                           value = "true"
                        },
-                       {
-                           name  = "DD_ENV"
-                           value = "staging"
                        },
-                       {
-                           name  = "DD_PROFILING_ENABLED"
-                           value = "true"
                        },
-                       {
-                           name  = "DD_SERVICE"
-                           value = "gost"
                        },
-                       {
-                           name  = "DD_VERSION"
-                           value = "4974fb67de8fb5097b7840a13b32997e1455731f"
                        },
-                       {
-                           name  = "ECS_FARGATE"
-                           value = "true"
                        },
                    ]
-                   essential              = false
-                   image                  = "public.ecr.aws/datadog/agent:latest"
-                   mountPoints            = []
-                   name                   = "datadog"
-                   portMappings           = []
-                   readonlyRootFilesystem = false
-                   secrets                = [
-                       {
-                           name      = "DD_API_KEY"
-                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key"
                        },
                    ]
-                   stopTimeout            = 60
-                   volumesFrom            = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ cpu                      = "512" -> "256" # forces replacement
      ~ id                       = "gost-staging-api" -> (known after apply)
      ~ memory                   = "2048" -> "512" # forces replacement
      ~ revision                 = 30 -> (known after apply)
-       tags                     = {} -> null
        # (7 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.arpa_audit_report.aws_appautoscaling_policy.sqs_scale_down_ecs_tasks will be created
+   resource "aws_appautoscaling_policy" "sqs_scale_down_ecs_tasks" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "gost-staging-sqs-scale_down"
+       policy_type        = "StepScaling"
+       resource_id        = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       step_scaling_policy_configuration {
+           adjustment_type         = "ExactCapacity"
+           metric_aggregation_type = "Average"

+           step_adjustment {
+               metric_interval_upper_bound = "0"
+               scaling_adjustment          = 0
            }
        }
    }

  # module.arpa_audit_report.aws_appautoscaling_policy.sqs_scale_up_ecs_tasks will be created
+   resource "aws_appautoscaling_policy" "sqs_scale_up_ecs_tasks" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "gost-staging-sqs-scale_up"
+       policy_type        = "StepScaling"
+       resource_id        = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       step_scaling_policy_configuration {
+           adjustment_type         = "ExactCapacity"
+           cooldown                = 60
+           metric_aggregation_type = "Average"

+           step_adjustment {
+               metric_interval_lower_bound = "0"
+               metric_interval_upper_bound = "1"
+               scaling_adjustment          = 1
            }
+           step_adjustment {
+               metric_interval_lower_bound = "1"
+               metric_interval_upper_bound = "3"
+               scaling_adjustment          = 2
            }
+           step_adjustment {
+               metric_interval_lower_bound = "10"
+               metric_interval_upper_bound = "20"
+               scaling_adjustment          = 5
            }
+           step_adjustment {
+               metric_interval_lower_bound = "20"
+               metric_interval_upper_bound = "50"
+               scaling_adjustment          = 6
            }
+           step_adjustment {
+               metric_interval_lower_bound = "3"
+               metric_interval_upper_bound = "5"
+               scaling_adjustment          = 3
            }
+           step_adjustment {
+               metric_interval_lower_bound = "5"
+               metric_interval_upper_bound = "10"
+               scaling_adjustment          = 4
            }
+           step_adjustment {
+               metric_interval_lower_bound = "50"
+               scaling_adjustment          = 7
            }
        }
    }

  # module.arpa_audit_report.aws_appautoscaling_target.desired_count will be created
+   resource "aws_appautoscaling_target" "desired_count" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       max_capacity       = 7
+       min_capacity       = 0
+       resource_id        = "service/gost-staging/gost-staging"
+       role_arn           = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"
+       tags_all           = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
    }

  # module.arpa_audit_report.aws_cloudwatch_log_group.default will be created
+   resource "aws_cloudwatch_log_group" "default" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = (known after apply)
+       name_prefix       = "gost-staging-"
+       retention_in_days = 14
+       skip_destroy      = false
+       tags_all          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
    }

  # module.arpa_audit_report.aws_cloudwatch_metric_alarm.sqs-scale_down_tasks will be created
+   resource "aws_cloudwatch_metric_alarm" "sqs-scale_down_tasks" {
+       actions_enabled                       = true
+       alarm_actions                         = (known after apply)
+       alarm_description                     = "Decreases tasks based on source queue size."
+       alarm_name                            = "gost-staging-SQS-ScaleDown-Tasks"
+       arn                                   = (known after apply)
+       comparison_operator                   = "LessThanThreshold"
+       dimensions                            = (known after apply)
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "ApproximateNumberOfMessagesVisible"
+       namespace                             = "AWS/SQS"
+       period                                = 60
+       statistic                             = "Sum"
+       tags_all                              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       threshold                             = 1
+       treat_missing_data                    = "missing"
    }

  # module.arpa_audit_report.aws_cloudwatch_metric_alarm.sqs_scale_up_ecs_tasks will be created
+   resource "aws_cloudwatch_metric_alarm" "sqs_scale_up_ecs_tasks" {
+       actions_enabled                       = true
+       alarm_actions                         = (known after apply)
+       alarm_description                     = "Increases tasks based on source queue size."
+       alarm_name                            = "gost-staging-SQS-ScaleUp-Tasks"
+       arn                                   = (known after apply)
+       comparison_operator                   = "GreaterThanOrEqualToThreshold"
+       dimensions                            = (known after apply)
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "ApproximateNumberOfMessagesVisible"
+       namespace                             = "AWS/SQS"
+       period                                = 60
+       statistic                             = "Sum"
+       tags_all                              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       threshold                             = 1
+       treat_missing_data                    = "missing"
    }

  # module.arpa_audit_report.aws_ecs_service.default will be created
+   resource "aws_ecs_service" "default" {
+       cluster                            = "arn:aws:ecs:us-west-2:357150818708:cluster/gost-staging"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 0
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "gost-staging"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = [
+               "sg-09b90196ed40630de",
            ]
+           subnets          = (sensitive value)
        }
    }

  # module.arpa_audit_report.aws_ecs_task_definition.consumer will be created
+   resource "aws_ecs_task_definition" "consumer" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = (sensitive value)
+       cpu                      = "1024"
+       execution_role_arn       = (known after apply)
+       family                   = "gost-staging"
+       id                       = (known after apply)
+       memory                   = "4096"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       task_role_arn            = (known after apply)

+       runtime_platform {
+           cpu_architecture        = "ARM64"
+           operating_system_family = "LINUX"
        }

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }
    }

  # module.arpa_audit_report.aws_iam_role.execution will be created
+   resource "aws_iam_role" "execution" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "gost-staging-ECSExec-"
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       role_last_used        = (known after apply)
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.arpa_audit_report.aws_iam_role.task will be created
+   resource "aws_iam_role" "task" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Condition = {
+                           ArnLike      = {
+                               "aws:SourceArn" = "arn:aws:ecs:us-west-2:357150818708:*"
                            }
+                           StringEquals = {
+                               "aws:SourceAccount" = "357150818708"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "gost-staging-ECSTask-"
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       role_last_used        = (known after apply)
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.arpa_audit_report.aws_iam_role_policy.execution["decrypt-datadog-api-key"] will be created
+   resource "aws_iam_role_policy" "execution" {
+       id     = (known after apply)
+       name   = "decrypt-datadog-api-key"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "kms:Decrypt"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key",
+                           "arn:aws:kms:us-west-2:357150818708:key/df1661b4-62e5-4668-8e39-f872c9acfceb",
                        ]
+                       Sid      = "DecryptWithKMS"
                    },
+                   {
+                       Action   = [
+                           "ssm:GetParameters",
+                           "secretsmanager:GetSecretValue",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key"
+                       Sid      = "GetSecretParameters"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.arpa_audit_report.aws_iam_role_policy.execution["write-logs"] will be created
+   resource "aws_iam_role_policy" "execution" {
+       id     = (known after apply)
+       name   = "write-logs"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.arpa_audit_report.aws_iam_role_policy.task["connect-to-postgres"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "connect-to-postgres"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "rds-db:connect"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:rds-db:us-west-2:357150818708:dbuser:cluster-MB5CSR4GERRMATFYFNW7H6HPWY/postgres"
+                       Sid      = "DBAccess"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.arpa_audit_report.aws_iam_role_policy.task["consume-sqs-messages"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "consume-sqs-messages"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.arpa_audit_report.aws_iam_role_policy.task["ecs-exec"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "ecs-exec"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ssmmessages:OpenDataChannel",
+                           "ssmmessages:OpenControlChannel",
+                           "ssmmessages:CreateDataChannel",
+                           "ssmmessages:CreateControlChannel",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "AllowExec"
                    },
+                   {
+                       Action   = "logs:DescribeLogGroups"
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "InventoryLogGroupsForExec"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.arpa_audit_report.aws_iam_role_policy.task["rw-audit-reports-bucket"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "rw-audit-reports-bucket"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:PutObject",
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::gost-staging-arpaauditreports-357150818708-us-west-2-api/*"
+                       Sid      = "ReadWriteBucketObjects"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.arpa_audit_report.aws_iam_role_policy.task["write-logs"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "write-logs"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.arpa_audit_report_to_postgres_security_group.aws_security_group.cbd[0] will be created
+   resource "aws_security_group" "cbd" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Attributes" = "arpaauditreport-postgres"
+           "Name"       = "gost-staging-arpaauditreport-postgres"
+           "Namespace"  = "gost-staging"
        }
+       tags_all               = {
+           "Attributes" = "arpaauditreport-postgres"
+           "Name"       = "gost-staging-arpaauditreport-postgres"
+           "Namespace"  = "gost-staging"
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       vpc_id                 = (sensitive value)

+       timeouts {
+           create = "10m"
+           delete = "15m"
        }
    }

  # module.arpa_audit_report_to_postgres_security_group.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
+   resource "aws_security_group_rule" "keyed" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Allow all egress"
+       from_port                = 0
+       id                       = (known after apply)
+       ipv6_cidr_blocks         = [
+           "::/0",
        ]
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 0
+       type                     = "egress"
    }

  # module.arpa_audit_report_to_postgres_security_group.null_resource.sync_rules_and_sg_lifecycles[0] will be created
+   resource "null_resource" "sync_rules_and_sg_lifecycles" {
+       id       = (known after apply)
+       triggers = {
+           "sg_ids" = (known after apply)
        }
    }

  # module.arpa_audit_report_to_postgres_security_group.random_id.rule_change_forces_new_security_group[0] will be created
+   resource "random_id" "rule_change_forces_new_security_group" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 3
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
+       keepers     = {
+           "rules" = jsonencode(
                {
+                   _allow_all_egress_ = {
+                       cidr_blocks              = [
+                           "0.0.0.0/0",
                        ]
+                       description              = "Allow all egress"
+                       from_port                = 0
+                       ipv6_cidr_blocks         = [
+                           "::/0",
                        ]
+                       key                      = "_allow_all_egress_"
+                       prefix_list_ids          = []
+                       protocol                 = "-1"
+                       security_groups          = []
+                       self                     = null
+                       source_security_group_id = null
+                       to_port                  = 0
+                       type                     = "egress"
                    }
                }
            )
        }
    }

  # module.consume_grants.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-consume_grants"
        name                               = "gost-staging-consume_grants"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants:15" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.consume_grants.aws_ecs_task_definition.consume_grants must be replaced
+/- resource "aws_ecs_task_definition" "consume_grants" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants:15" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "gost-staging-consume_grants" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 15 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.arpa_audit_report.module.consume_sqs_messages_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "sqs:DeleteMessage",
+               "sqs:ReceiveMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowConsumeMessages"
        }
+       statement {
+           actions   = [
+               "sqs:GetQueueAttributes",
+               "sqs:GetQueueUrl",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowReadMetadata"
        }
    }

  # module.arpa_audit_report.module.sqs_queue.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "sqs:SendMessage",
+               "sqs:SendMessageBatch",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
+           sid       = "AllowPublishMessages"

+           condition {
+               test     = "ArnEquals"
+               values   = [
+                   "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api",
                ]
+               variable = "aws:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "ecs-tasks.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.arpa_audit_report.module.sqs_queue.aws_sqs_queue.dlq[0] will be created
+   resource "aws_sqs_queue" "dlq" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 0
+       fifo_queue                        = false
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 1024
+       message_retention_seconds         = 1209600
+       name                              = (known after apply)
+       name_prefix                       = "gost-staging-dlq-"
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 20
+       redrive_allow_policy              = (known after apply)
+       redrive_policy                    = (known after apply)
+       sqs_managed_sse_enabled           = true
+       tags_all                          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 30
    }

  # module.arpa_audit_report.module.sqs_queue.aws_sqs_queue.this[0] will be created
+   resource "aws_sqs_queue" "this" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 0
+       fifo_queue                        = false
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 1024
+       message_retention_seconds         = 10080
+       name                              = (known after apply)
+       name_prefix                       = "gost-staging-"
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 20
+       redrive_allow_policy              = (known after apply)
+       redrive_policy                    = (known after apply)
+       sqs_managed_sse_enabled           = true
+       tags_all                          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 30
    }

  # module.arpa_audit_report.module.sqs_queue.aws_sqs_queue_policy.this[0] will be created
+   resource "aws_sqs_queue_policy" "this" {
+       id        = (known after apply)
+       policy    = (known after apply)
+       queue_url = (known after apply)
    }

  # module.arpa_audit_report.module.sqs_queue.aws_sqs_queue_redrive_allow_policy.dlq[0] will be created
+   resource "aws_sqs_queue_redrive_allow_policy" "dlq" {
+       id                   = (known after apply)
+       queue_url            = (known after apply)
+       redrive_allow_policy = (known after apply)
    }

  # module.arpa_audit_report.module.sqs_queue.aws_sqs_queue_redrive_policy.dlq[0] will be created
+   resource "aws_sqs_queue_redrive_policy" "dlq" {
+       id             = (known after apply)
+       queue_url      = (known after apply)
+       redrive_policy = (known after apply)
    }

  # module.arpa_audit_report.module.write_logs_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "logs:CreateLogStream",
+               "logs:DescribeLogStreams",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "WriteLogs"
        }
    }

  # module.postgres.module.db.aws_security_group_rule.this["from_arpa_audit_report"] will be created
+   resource "aws_security_group_rule" "this" {
+       from_port                = 5432
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = "sg-0b1895f711684bb06"
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 5432
+       type                     = "ingress"
    }

  # module.api.module.efs_data_volume.module.security_group.aws_security_group_rule.keyed["_m[0]#in#sg#1"] will be created
+   resource "aws_security_group_rule" "keyed" {
+       description              = "Allow ingress EFS traffic"
+       from_port                = 2049
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = "sg-0c612a9e9d3e9a992"
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 2049
+       type                     = "ingress"
    }

Plan: 31 to add, 2 to change, 2 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: `Terraform CI`*